{
  "generations": [
    {
      "title": "1st Known Generation",
      "people": [
        {
          "id": "wori",
          "name": "Wori",
          "info": "Wori was the elder brother among the three founding brothers of the Malari sub-clan. He grew up with his brothers Dabe and an unnamed younger brother. After the younger brother's death, Wori suspected the widow Landu of complicity and demanded investigation, leading to consultations with witch doctors. His actions intensified family conflicts, including attempts to execute Landu and ongoing animosity with Dabe. Wori married an unnamed wife who later died, allegedly due to witchcraft from Dabe's side. His lineage remained sketchy in oral history, but descendants include Rabuk Kabur Lobiji and grandchildren. Wori's pursuit of 'justice' through unproductive methods like witch doctors contributed to the split of the Malari clan into mainstream Malari and Jonyari.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "dabe",
          "name": "Dabe",
          "info": "Dabe was the middle brother of the three founding brothers of the Malari sub-clan. He opposed Wori's unfounded suspicions against Landu, the widow of their younger brother, and challenged the clan's verdict to execute her. Dabe secretly inherited Landu and bore children with her, including Koboji, Lopia, and an unnamed son. He married a legitimate unnamed wife who bore only daughters but left jealously when Landu gave birth to a son. Dabe's resentment against the clan's actions led him to abort the assassination of Landu. Conflicts with Wori escalated through reciprocal witchcraft, culminating in Wori's wife's death and Dabe's assassination by her relatives. Shot with an arrow while urinating outside, Dabe fought back, killing three attackers, but died from septic injury. His last words instructed Landu to flee to Liwolo with their baby Koboji and a specific cow named Songo for sustenance. Biologically the father of Jonyari descendants, but culturally considered the uncle as the children belonged to his late younger brother.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "younger-brother-name-unknown",
          "name": "Younger Brother (Name Unknown)",
          "info": "The youngest of the three brothers who formed the Malari sub-clan. He married Landu from Liwolo but died under incomprehensible circumstances, possibly without children, as there are no references to his descendants. His death sparked suspicions from Wori, leading to clan conflicts. Culturally, he is considered the father of the children borne by Landu after inheritance by Dabe, including Koboji and his brothers.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "landu",
          "name": "Landu",
          "info": "Landu was from Liwolo and the wife of the unnamed younger brother. After his death, she was accused by Wori of complicity and nearly executed based on a witch doctor's chicken ritual pointing to her. Saved by Dabe, who inherited her, she bore Koboji, Lopia, and an unnamed son. Following Dabe's death, she fled to her family in Liwolo with baby Koboji and the cow Songo, as per Dabe's instructions. She fulfilled mourning obligations and raised Koboji there. Landu is the ancestress of all Jonyari descendants, negating derogatory terms like 'inherited rutat' within the clan.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "unnamed-wife-of-dabe",
          "name": "Unnamed Wife of Dabe",
          "info": "The legitimate wife of Dabe, name unknown. She bore only baby girls and became jealous when Dabe inherited Landu and bore a son. She left with her daughters to her family, and their whereabouts remain unknown to date. No further accounts of her or her descendants.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "unnamed-wife-of-wori",
          "name": "Unnamed Wife of Wori",
          "info": "The wife of Wori, name unknown. She died, allegedly due to witchcraft from Dabe's side in retaliation to Wori's actions. Her death outraged her relatives, leading to Dabe's assassination. No further details on her or immediate children, though Wori's lineage continues through descendants like Rabuk Kabur Lobiji.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        }
      ]
    },
    {
      "title": "2nd Known Generation",
      "people": [
        {
          "id": "koboji",
          "name": "Koboji",
          "info": "Koboji was the son of Dabe and his inherited wife Landu, culturally the son of the unnamed younger brother. As a baby, he fled with Landu to Liwolo after Dabe's death, raised by uncles there. He received a piece of land named Yibur, traditionally belonging to Jonyari grandchildren. Koboji married Likiya from Jingoro-Liwolo and fathered Moju, Lo’du, and Tongidyang. He defined his own identity by forming the Jonyari sub-clan, splintering from Malari. Second greatest grandparent in Jonyari hierarchy. His exile and potential return raise cultural questions about reconciliations with Wori's descendants.",
          "fatherId": "younger-brother-name-unknown",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lopia",
          "name": "Lopia",
          "info": "Lopia was a son of Dabe and Landu, culturally belonging to the unnamed younger brother. His history remains bleak with no further accounts about him or his descendants.",
          "fatherId": "younger-brother-name-unknown",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "unnamed-son-of-landu",
          "name": "Unnamed Son of Landu",
          "info": "An unnamed son of Dabe and Landu, culturally belonging to the unnamed younger brother. His history remains bleak with no further accounts about him or his descendants.",
          "fatherId": "younger-brother-name-unknown",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "likiya",
          "name": "Likiya",
          "info": "Likiya was from the clan of Jingoro-Liwolo and the wife of Koboji. She gave birth to Moju, Lo’du, and Tongidyang.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "rabuk-kabur-lobiji",
          "name": "Rabuk Kabur Lobiji",
          "info": "Rabuk Kabur Lobiji is a continued descendant of Wori's lineage. The oral history of Wori's family is scarce, but Rabuk and his grandchildren represent this line of the Malari clan.",
          "fatherId": "wori",
          "birthYear": "unknown",
          "deathYear": "unknown"
        }
      ]
    },
    {
      "title": "3rd Known Generation",
      "people": [
        {
          "id": "moju",
          "name": "Moju",
          "info": "Moju was a son of Koboji and Likiya. He married an unnamed wife and fathered Landu (also known as Congo), Poni, and Joputo.",
          "fatherId": "koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lo-du",
          "name": "Lo’du",
          "info": "Lo’du was a son of Koboji and Likiya. He married Muggo from the clan of Saburi and fathered an unnamed baby boy before dying young. Muggo was then inherited by Wori Kau (a blacksmith, not blood-related), producing Lutan, who is culturally Jonyari via bride wealth.",
          "fatherId": "koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "tongidyang",
          "name": "Tongidyang",
          "info": "Tongidyang was a son of Koboji and Likiya. He married Suku from the clan of Korsak and fathered Dabe (Jr), Amunuki, and Lupai (Lubadu). The family experienced persistent deaths, leaving Lupai as the sole survivor, who was repatriated to Korsak uncles. No accounts about their sisters.",
          "fatherId": "koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "unnamed-wife-of-moju",
          "name": "Unnamed Wife of Moju",
          "info": "The wife of Moju, name unknown. She gave birth to Landu (Congo), Poni, and Joputo.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "muggo",
          "name": "Muggo",
          "info": "Muggo was from the clan of Saburi and wife of Lo’du. She gave birth to an unnamed baby boy with Lo’du. After Lo’du's death, she was inherited by Wori Kau and gave birth to Lutan.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "suku",
          "name": "Suku",
          "info": "Suku was from the clan of Korsak and wife of Tongidyang. She gave birth to Dabe (Jr), Amunuki, and Lupai.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "wori-kau",
          "name": "Wori Kau",
          "info": "Wori Kau was a professional blacksmith (Tumunit) for the Jonyari, not blood-related. He inherited Muggo after Lo’du's death and fathered Lutan. The generation from this inheritance is culturally Jonyari due to bride wealth.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        }
      ]
    },
    {
      "title": "4th Known Generation",
      "people": [
        {
          "id": "landu-congo",
          "name": "Landu (Congo)",
          "info": "Landu, also known as Congo, was a child of Moju and his unnamed wife. Gave birth to Yangi, Giye, Likiya, and Koboji (who died young).",
          "fatherId": "moju",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "poni-of-moju",
          "name": "Poni (of Moju)",
          "info": "Poni was a child of Moju and his unnamed wife. Nothing known about Poni's grandchildren.",
          "fatherId": "moju",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "joputo",
          "name": "Joputo",
          "info": "Joputo was a child of Moju and his unnamed wife. Gave birth to Jokudu, Lodiong, and Likiya.",
          "fatherId": "moju",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "unnamed-baby-boy-of-lo-du",
          "name": "Unnamed Baby Boy of Lo'du",
          "info": "The unnamed baby boy of Lo'du and Muggo. History unknown.",
          "fatherId": "lo-du",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lutan",
          "name": "Lutan",
          "info": "Lutan was born to Muggo and Wori Kau after inheritance. Culturally Jonyari via bride wealth. Married Ijang and gave birth to Lupe and Anna Kiden. Also inherited an unnamed wife from elsewhere, mother of Roba Lokuli.",
          "fatherId": "wori-kau",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "dabe-jr",
          "name": "Dabe (Jr)",
          "info": "Dabe Jr was a son of Tongidyang and Suku. Married Doru from Romoggi-Liwolo and gave birth to Poni Na Dabe and Modi (died young). After his death, Lupai inherited Doru and bore Abrama Mogga (culturally Dabe's). Also married Giye from Liekor-Liwolo and gave birth to Nikademo Logbong and Priscilla Baye (mother of Bismarck Bungit), culturally his via bride wealth.",
          "fatherId": "tongidyang",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "amunuki",
          "name": "Amunuki",
          "info": "Amunuki was a son of Tongidyang and Suku. Engaged to Gire from Leikor-Liwolo, but died before wedding due to a taboo (howling during his marriage ceremony and mother-in-law's response). Bride wealth was paid, so Gire was considered his wife and inherited by Lupai. Death inconceivable and mind-juggling. Ancestor to Ebele Kitenge, Petero Koboji, Muja, Sarah Leong, and Modong.",
          "fatherId": "tongidyang",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lupai-lubadu-moron",
          "name": "Lupai (Lubadu or Moron)",
          "info": "Lupai, originally named Lubadu and nicknamed 'the rejected one' for unknown reasons, was the son of Tongidyang and Suku. Sole survivor of family misfortunes, repatriated to Korsak uncles as a mature married man with household. Inherited wives from brothers: Doru (bore Abrama Mogga), Giye (from Dabe Jr), and Gire (from Amunuki, bore Ebele Kitenge etc.). Married legitimate wife Raele Adede and bore Wani Bungu, Purumena Tutuan, Rebecca Juan, Morris Murye, and Elisabeta Yari. Ranked fourth in known grandparents. Bailed out from Korsak on March 3, 2012, to resolve social traits and misfortunes. Profile highlights exile due to family deaths and cultural practices.",
          "fatherId": "tongidyang",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "ijang",
          "name": "Ijang",
          "info": "Ijang was the wife of Lutan. Gave birth to Lupe and Anna Kiden.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "unnamed-mother-of-roba-lokuli",
          "name": "Unnamed Mother of Roba Lokuli",
          "info": "Inherited by Lutan from elsewhere. Gave birth to Roba Lokuli.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "doru",
          "name": "Doru",
          "info": "Doru was from Romoggi-Liwolo and first wife of Dabe Jr. Gave birth to Poni Na Dabe and Modi (died young). Inherited by Lupai after Dabe's death, bore Abrama Mogga (culturally Dabe's).",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "giye-wife-of-dabe-jr",
          "name": "Giye (Wife of Dabe Jr)",
          "info": "Giye was from Liekor-Liwolo and second wife of Dabe Jr. Gave birth to Nikademo Logbong and Priscilla Baye (mother of Bismarck Bungit). Children culturally legitimate to Dabe.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "gire",
          "name": "Gire",
          "info": "Gire was the daughter of Buju from Leikor-Liwolo, engaged to Amunuki. Beautiful light-skinned lady admired by many. Eloped by a colonial master (Jaalia) after Amunuki's death but recovered diplomatically. Considered legitimate wife of Jonyari due to paid bride wealth. Developed wounds, suspected witchcraft, handed to Lupai who inherited her. Gave birth to Ebele Kitenge, Petero Koboji, Muja, Sarah Leong, and Modong (culturally Amunuki's).",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "raele-adede-wori-kajanyiri",
          "name": "Raele Adede (Wori Kajanyiri)",
          "info": "Raele Adede was from Kagiri in Bori-Kangapu ii Payam and the first legitimate wife of Lupai. Dispatched to Lupai amid concerns over his inheritances. Gave birth to Wani Bungu, Purumena Tutuan, Rebecca Juan, Morris Murye, and Elisabeta Yari. Traditionally the primary wife, with inherited wives referenced to their late husbands.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        }
      ]
    },
    {
      "title": "5th Known Generation",
      "people": [
        {
          "id": "yangi",
          "name": "Yangi",
          "info": "Yangi was a child of Landu (Congo). No further details.",
          "fatherId": "landu-congo",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "giye-of-congo",
          "name": "Giye (of Congo)",
          "info": "Giye was a child of Landu (Congo). No further details.",
          "fatherId": "landu-congo",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "likiya-of-congo",
          "name": "Likiya (of Congo)",
          "info": "Likiya was a child of Landu (Congo). No further details.",
          "fatherId": "landu-congo",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "koboji-of-congo",
          "name": "Koboji (of Congo)",
          "info": "Koboji was a child of Landu (Congo). Died young.",
          "fatherId": "landu-congo",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "jokudu",
          "name": "Jokudu",
          "info": "Jokudu was a child of Joputo. No further details.",
          "fatherId": "joputo",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lodiong-of-joputo",
          "name": "Lodiong (of Joputo)",
          "info": "Lodiong was a child of Joputo. No further details.",
          "fatherId": "joputo",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "likiya-of-joputo",
          "name": "Likiya (of Joputo)",
          "info": "Likiya was a child of Joputo. No further details.",
          "fatherId": "joputo",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lupe",
          "name": "Lupe",
          "info": "Yaba Lupe was a child of Lutan and Ijang. No further details.",
          "fatherId": "lutan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "anna-kiden",
          "name": "Anna Kiden",
          "info": "Anna Kiden was a child of Lutan and Ijang. No further details.",
          "fatherId": "lutan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "roba-lokuli",
          "name": "Roba Lokuli",
          "info": "Roba Lokuli was a child of Lutan and his inherited unnamed wife. Married Marata Wori Gudi (daughter of Gudi) and gave birth to Mojule and others.",
          "fatherId": "lutan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "poni-na-dabe",
          "name": "Poni Na Dabe",
          "info": "Poni, popularly known as Poni Na Dabe, was a child of Dabe Jr and Doru. No further details.",
          "fatherId": "dabe-jr",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "modi",
          "name": "Modi",
          "info": "Modi was a child of Dabe Jr and Doru. Died young.",
          "fatherId": "dabe-jr",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "abrama-mogga",
          "name": "Abrama Mogga",
          "info": "Abrama Mogga was born to Doru and Lupai after inheritance, culturally child of Dabe Jr. Ancestor to Yisaka Piso, Lea Suku, Timoteo Tongidyang, Ryembe, Gordon Yama Lo’du, Grace Talata, Joseph Yanga, and Tola from first wife Elisabeta Ropi; Cyrus Tongidyang (Khamis Laila), Suku (Zande), Joyce Kiden (Yanya), and Henry Jenge from second wife Grace Juan; Richard Taban (Tongidyang), Sylvia Suku (Dudu), and Monday from third wife Pilista Juru (separated by Anyanya war, other children out of wedlock - cultural status questionable).",
          "fatherId": "dabe-jr",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "nikademo-logbong",
          "name": "Nikademo Logbong",
          "info": "Nikademo Logbong was a child of Dabe Jr and Giye. Culturally legitimate to Dabe. No further details.",
          "fatherId": "dabe-jr",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "priscilla-baye",
          "name": "Priscilla Baye",
          "info": "Priscilla Baye was a child of Dabe Jr and Giye. Mother of Bismarck Bungit. Culturally legitimate to Dabe.",
          "fatherId": "dabe-jr",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "ebele-kitenge-doko-gubaji",
          "name": "Ebele Kitenge (Doko or Gubaji)",
          "info": "Ebele Kitenge, sometimes called Doko or Gubaji, was born to Gire and Lupai, culturally child of Amunuki. Father of Gamba, Stanley Roba, Nicolas Buju, Suku, Ijang, Kabudu, and Tongidyang (Dwoki) from first wife Sokale; Taban Abel (Yamba), Suku (Wiling-wiling), Makka, Yata, Kenyi John, and Lo’du Bismarck from second wife Yanya from Wandi clan.",
          "fatherId": "amunuki",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "petero-koboji",
          "name": "Petero Koboji",
          "info": "Petero Koboji was born to Gire and Lupai, culturally child of Amunuki. Father of Sokiri, Joselin Juan (Wori Giye), Pita Na Petero, Ko’do, Buju, Tongidyang, and Abate.",
          "fatherId": "amunuki",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "muja",
          "name": "Muja",
          "info": "Muja was born to Gire and Lupai, culturally child of Amunuki. No further details.",
          "fatherId": "amunuki",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "sarah-leong",
          "name": "Sarah Leong",
          "info": "Sarah Leong was born to Gire and Lupai, culturally child of Amunuki. No further details.",
          "fatherId": "amunuki",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "modong-of-amunuki",
          "name": "Modong (of Amunuki)",
          "info": "Modong was born to Gire and Lupai, culturally child of Amunuki. No further details.",
          "fatherId": "amunuki",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "wani-bungu",
          "name": "Wani (Bungu)",
          "info": "Wani, commonly known as Bungu, was a child of Lupai and Raele Adede. Married Tabita Yobu and gave birth to Wilson Lodiong, Sartiele Yama Lo’du, Charity Suku, and Kiryembe; from second wife Kaku gave birth to William Wolyan, Escesles Nnyarsuk, and Joy Yine. There were others born out of wedlock.",
          "fatherId": "lupai-lubadu-moron",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "purumena-logborong-tutuan",
          "name": "Purumena Logborong (Tutuan)",
          "info": "Purumena, also called Tutuan, was a child of Lupai and Raele Adede. Descendants include Gordon Sula, Maika Duke, Charles Lisi, Milton Wani, Jaguru, and Yine from first wife Maria Woro of Wandi; Bulson Bulli, Simon Ladu, Modong, Guo, and Augustino Wolyan from second wife Juan of Pojulu; Taban Nelson (Tongidyang), Suku, Dudu, Subek Nandera, Emmanuel Lo’du, Bongiri, Doru, and Muggo from third wife Poni Na Kei. Others born out of wedlock.",
          "fatherId": "lupai-lubadu-moron",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "rebecca-juan",
          "name": "Rebecca Juan",
          "info": "Rebecca Juan was a child of Lupai and Raele Adede. No further details.",
          "fatherId": "lupai-lubadu-moron",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "morris-murye",
          "name": "Morris Murye",
          "info": "Morris Murye was a child of Lupai and Raele Adede. Descendants include Pita, Azaria Wolyan, Chaplain Soso (Tongidyang), Simon Wolyan, Cecelia Yine, Joseph Loguli, Rejoice Poni, Julius Bongo, and Oliver Losuba (Gwolo) from first wife Rebecca Kiden of Loringa-Bura; Nora 'Balai, Helda Suku, Rasulia Modong, Wanijo, Lucia Yanya, Isso (Gire), Mama, Margret Yine, and Muggo from second wife Christina 'Diko of Wandi. Murye lived for an estimated 55years, and then he unfornately passed on. He was mourned and buried on 26th-Februry, 1979 in Boro-boro.",
          "fatherId": "lupai-lubadu-moron",
          "birthYear": "01:01:1927",
          "deathYear": "26:02:1979"
        },
        {
          "id": "rebecca-kiden",
          "name": "Rebecca Kiden",
          "info": "Rebecca Kiden was the daughter of Wani-Konyi from Loringa-Bura clan and first legitimate wife of Morris Murye. Gave birth to Pita, Azaria Wolyan, Chaplain Soso (Tongidyang), Simon Wolyan, Cecelia Yine, Joseph Loguli, Rejoice Poni, Julius Bongo, and Oliver Losuba (Gwolo). She was believed have lived for an estimated 72 years of age and she finally died and was mourned and buried on unkwnon date around the year 2002/2003 in Dongoda village.",
          "fatherId": null,
          "birthYear": "12:12:1930",
          "deathYear": "Deceased"
        },
        {
          "id": "christina-diko",
          "name": "Christina 'Diko",
          "info": "Christina 'Diko was from the Wandi clan and second legitimate wife of Morris Murye. Gave birth to Nora 'Balai, Helda Suku, Rasulia Modong, Wanijo, Lucia Yanya, Isso (Gire), Mama, Margret Yine, and Muggo.",
          "fatherId": null,
          "birthYear": "01:01:1929",
          "deathYear": "Deceased"
        },
        {
          "id": "elisabeta-yari",
          "name": "Elisabeta Yari",
          "info": "Elisabeta Yari was a child of Lupai and Raele Adede. Denied education by brothers, leading to illusions interpreted as potential curse on girl child education in the clan, but forgiven and resolved during bailout occasion.",
          "fatherId": "lupai-lubadu-moron",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "marata-wori-gudi",
          "name": "Marata Wori Gudi",
          "info": "Marata was the daughter of Gudi and wife of Roba Lokuli. Gave birth to Mojule and others.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "elisabeta-ropi",
          "name": "Elisabeta Ropi",
          "info": "Elisabeta Ropi was the first legitimate wife of Abrama Mogga. Gave birth to Yisaka Piso, Lea Suku, Timoteo Tongidyang, Ryembe, Gordon Yama Lo’du, Grace Talata, Joseph Yanga, and Tola.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "grace-juan",
          "name": "Grace Juan",
          "info": "Grace Juan was the daughter of Boro from Dongoro and second legitimate wife of Abrama Mogga. Gave birth to Cyrus Tongidyang (Khamis Laila), Suku (Zande), Joyce Kiden (Yanya), and Henry Jenge.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "pilista-juru",
          "name": "Pilista Juru",
          "info": "Pilista Juru was the third legitimate wife of Abrama Mogga. Separated by Anyanya war, gave birth to Richard Taban (Tongidyang), Sylvia Suku (Dudu), and Monday; bore other children out of wedlock, cultural status as Jonyari questionable.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "sokale",
          "name": "Sokale",
          "info": "Sokale was the first legitimate wife of Ebele Kitenge. Gave birth to Gamba, Stanley Roba, Nicolas Buju, Suku, Ijang, Kabudu, and Tongidyang (Dwoki).",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "yanya-of-wandi",
          "name": "Yanya (of Wandi)",
          "info": "Yanya was from the Wandi clan and second legitimate wife of Ebele Kitenge. Gave birth to Taban Abel (Yamba), Suku (Wiling-wiling), Makka, Yata, Kenyi John, and Lo’du Bismarck.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "tabita-yobu",
          "name": "Tabita Yobu",
          "info": "Tabita Yobu was the first legitimate wife of Wani Bungu. Gave birth to Wilson Lodiong, Sartiele Yama Lo’du, Charity Suku, and Kiryembe. Involved in family concerns, including a resolved incident with Lena regarding pension entitlements.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "kaku",
          "name": "Kaku",
          "info": "Kaku was the second legitimate wife of Wani Bungu. Gave birth to William Wolyan, Escesles Nnyarsuk, and Joy Yine.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "maria-woro",
          "name": "Maria Woro",
          "info": "Maria Woro was from the Wandi clan and first legitimate wife of Purumena Tutuan. Gave birth to Gordon Sula, Maika Duke, Charles Lisi, Milton Wani, Jaguru, and Yine.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "juan-of-pojulu",
          "name": "Juan (of Pojulu)",
          "info": "Juan was from the Pojulu clan of Gaderu and second legitimate wife of Purumena Tutuan. Gave birth to Bulson Bulli, Simon Ladu, Modong, Guo, and Augustino Wolyan.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "poni-na-kei",
          "name": "Poni Na Kei",
          "info": "Poni Na Kei was the daughter of Kei and third legitimate wife of Purumena Tutuan. Gave birth to Taban Nelson (Tongidyang), Suku, Dudu, Subek Nandera, Emmanuel Lo’du, Bongiri, Doru, and Muggo.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        }
      ]
    },
    {
      "title": "6th Known Generation",
      "people": [
        {
          "id": "mojule",
          "name": "Mojule",
          "info": "Mojule was a child of Roba Lokuli and Marata Wori Gudi. Others unknown.",
          "fatherId": "roba-lokuli",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "yisaka-piso",
          "name": "Yisaka Piso",
          "info": "Yisaka Piso was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lea-suku",
          "name": "Lea Suku",
          "info": "Lea Suku was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "timoteo-tongidyang",
          "name": "Timoteo Tongidyang",
          "info": "Timoteo Tongidyang was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "ryembe",
          "name": "Ryembe",
          "info": "Ryembe was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "gordon-yama-lo-du",
          "name": "Gordon Yama Lo'du",
          "info": "Gordon Yama Lo'du was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "grace-talata",
          "name": "Grace Talata",
          "info": "Grace Talata was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "joseph-yanga",
          "name": "Joseph Yanga",
          "info": "Joseph Yanga was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "tola",
          "name": "Tola",
          "info": "Tola was a child of Abrama Mogga and Elisabeta Ropi. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "cyrus-tongidyang-khamis-laila",
          "name": "Cyrus Tongidyang (Khamis Laila)",
          "info": "Cyrus Tongidyang, sometimes called Khamis Laila, was a child of Abrama Mogga and Grace Juan. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "suku-zande",
          "name": "Suku (Zande)",
          "info": "Suku, also called Zande, was a child of Abrama Mogga and Grace Juan. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "joyce-kiden-yanya",
          "name": "Joyce Kiden (Yanya)",
          "info": "Joyce Kiden, also known as Yanya, was a child of Abrama Mogga and Grace Juan. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "henry-jenge",
          "name": "Henry Jenge",
          "info": "Henry Jenge was a child of Abrama Mogga and Grace Juan. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "richard-taban-tongidyang",
          "name": "Richard Taban (Tongidyang)",
          "info": "Richard Taban, also called Tongidyang, was a child of Abrama Mogga and Pilista Juru. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "sylvia-suku-dudu",
          "name": "Sylvia Suku (Dudu)",
          "info": "Sylvia Suku, also called Dudu, was a child of Abrama Mogga and Pilista Juru. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "monday",
          "name": "Monday",
          "info": "Monday was a child of Abrama Mogga and Pilista Juru. No further details.",
          "fatherId": "abrama-mogga",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "gamba",
          "name": "Gamba",
          "info": "Gamba was a child of Ebele Kitenge and Sokale. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "stanley-roba",
          "name": "Stanley Roba",
          "info": "Stanley Roba was a child of Ebele Kitenge and Sokale. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "nicolas-buju",
          "name": "Nicolas Buju",
          "info": "Nicolas Buju was a child of Ebele Kitenge and Sokale. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "suku-of-ebele",
          "name": "Suku (of Ebele)",
          "info": "Suku was a child of Ebele Kitenge and Sokale. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "ijang-of-ebele",
          "name": "Ijang (of Ebele)",
          "info": "Ijang was a child of Ebele Kitenge and Sokale. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "kabudu",
          "name": "Kabudu",
          "info": "Kabudu was a child of Ebele Kitenge and Sokale. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "tongidyang-dwoki",
          "name": "Tongidyang (Dwoki)",
          "info": "Tongidyang, sometimes called Dwoki, was a child of Ebele Kitenge and Sokale. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "taban-abel-yamba",
          "name": "Taban Abel (Yamba)",
          "info": "Taban Abel, also called Yamba, was a child of Ebele Kitenge and Yanya. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "suku-wiling-wiling",
          "name": "Suku (Wiling-wiling)",
          "info": "Suku, sometimes called Wiling-wiling, was a child of Ebele Kitenge and Yanya. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "makka",
          "name": "Makka",
          "info": "Makka was a child of Ebele Kitenge and Yanya. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "yata",
          "name": "Yata",
          "info": "Yata was a child of Ebele Kitenge and Yanya. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "kenyi-john",
          "name": "Kenyi John",
          "info": "Kenyi John was a child of Ebele Kitenge and Yanya. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "lo-du-bismarck",
          "name": "Lo'du Bismarck",
          "info": "Lo'du Bismarck was a child of Ebele Kitenge and Yanya. No further details.",
          "fatherId": "ebele-kitenge-doko-gubaji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "sokiri",
          "name": "Sokiri",
          "info": "Sokiri was a child of Petero Koboji. No further details.",
          "fatherId": "petero-koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "joselin-juan-wori-giye",
          "name": "Joselin Juan (Wori Giye)",
          "info": "Joselin Juan, also called Wori Giye, was a child of Petero Koboji. No further details.",
          "fatherId": "petero-koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "pita-na-petero",
          "name": "Pita Na Petero",
          "info": "Pita Na Petero was a child of Petero Koboji. No further details.",
          "fatherId": "petero-koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "ko-do",
          "name": "Ko'do",
          "info": "Ko'do was a child of Petero Koboji. No further details.",
          "fatherId": "petero-koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "buju-of-petero",
          "name": "Buju (of Petero)",
          "info": "Buju was a child of Petero Koboji. No further details.",
          "fatherId": "petero-koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "tongidyang-of-petero",
          "name": "Tongidyang (of Petero)",
          "info": "Tongidyang was a child of Petero Koboji. No further details.",
          "fatherId": "petero-koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "abate",
          "name": "Abate",
          "info": "Abate was a child of Petero Koboji. No further details.",
          "fatherId": "petero-koboji",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "wilson-lodiong",
          "name": "Wilson Lodiong",
          "info": "Wilson Lodiong was a child of Wani Bungu and Tabita Yobu. Family concerns about his unsettled children, including Lena, Lemi, and Larvina (who later settled). Incidents like maid's suicide and pension dispute with Tabita resolved.",
          "fatherId": "wani-bungu",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "sartiele-yama-lo-du",
          "name": "Sartiele Yama Lo'du",
          "info": "Sartiele Yama Lo'du was a child of Wani Bungu and Tabita Yobu. No further details.",
          "fatherId": "wani-bungu",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "charity-suku",
          "name": "Charity Suku",
          "info": "Charity Suku was a child of Wani Bungu and Tabita Yobu. No further details.",
          "fatherId": "wani-bungu",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "kiryembe",
          "name": "Kiryembe",
          "info": "Kiryembe was a child of Wani Bungu and Tabita Yobu. No further details.",
          "fatherId": "wani-bungu",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "william-wolyan",
          "name": "William Wolyan",
          "info": "William Wolyan was a child of Wani Bungu and Kaku. No further details.",
          "fatherId": "wani-bungu",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "escesles-nnyarsuk",
          "name": "Escesles Nnyarsuk",
          "info": "Escesles Nnyarsuk was a child of Wani Bungu and Kaku. No further details.",
          "fatherId": "wani-bungu",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "joy-yine",
          "name": "Joy Yine",
          "info": "Joy Yine was a child of Wani Bungu and Kaku. No further details.",
          "fatherId": "wani-bungu",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "gordon-sula",
          "name": "Gordon Sula",
          "info": "Gordon Sula was a child of Purumena Tutuan and Maria Woro. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "maika-duke",
          "name": "Maika Duke",
          "info": "Maika Duke was a child of Purumena Tutuan and Maria Woro. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "charles-lisi",
          "name": "Charles Lisi",
          "info": "Charles Lisi was a child of Purumena Tutuan and Maria Woro. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "milton-wani",
          "name": "Milton Wani",
          "info": "Milton Wani was a child of Purumena Tutuan and Maria Woro. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "jaguru",
          "name": "Jaguru",
          "info": "Jaguru was a child of Purumena Tutuan and Maria Woro. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "yine-of-purumena",
          "name": "Yine (of Purumena)",
          "info": "Yine was a child of Purumena Tutuan and Maria Woro. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "bulson-bulli",
          "name": "Bulson Bulli",
          "info": "Bulson Bulli was a child of Purumena Tutuan and Juan. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "simon-ladu",
          "name": "Simon Ladu",
          "info": "Simon Ladu was a child of Purumena Tutuan and Juan. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "modong-of-purumena",
          "name": "Modong (of Purumena)",
          "info": "Modong was a child of Purumena Tutuan and Juan. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "guo",
          "name": "Guo",
          "info": "Guo was a child of Purumena Tutuan and Juan. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "augustino-wolyan",
          "name": "Augustino Wolyan",
          "info": "Augustino Wolyan was a child of Purumena Tutuan and Juan. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "taban-nelson-tongidyang",
          "name": "Taban Nelson (Tongidyang)",
          "info": "Taban Nelson, also called Tongidyang, was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "suku-of-poni-na-kei",
          "name": "Suku (of Poni Na Kei)",
          "info": "Suku was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "dudu-of-poni-na-kei",
          "name": "Dudu (of Poni Na Kei)",
          "info": "Dudu was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "subek-nandera",
          "name": "Subek Nandera",
          "info": "Subek Nandera was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "emmanuel-lo-du",
          "name": "Emmanuel Lo'du",
          "info": "Emmanuel Lo'du was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "bongiri",
          "name": "Bongiri",
          "info": "Bongiri was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "doru-of-poni-na-kei",
          "name": "Doru (of Poni Na Kei)",
          "info": "Doru was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "muggo-of-poni-na-kei",
          "name": "Muggo (of Poni Na Kei)",
          "info": "Muggo was a child of Purumena Tutuan and Poni Na Kei. No further details.",
          "fatherId": "purumena-logborong-tutuan",
          "birthYear": "unknown",
          "deathYear": "unknown"
        },
        {
          "id": "pita-of-morris",
          "name": "Pita (of Morris)",
          "info": "Pita was a child of Morris Murye and Rebecca Kiden. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:06:1947",
          "deathYear": "01:01:1948"
        },
        {
          "id": "azaria-wolyan",
          "name": "Azaria Wolyan",
          "info": "Azaria Wolyan was a child of Morris Murye and Rebecca Kiden. Key informant for the clan history, providing invaluable knowledge and clarifications.",
          "fatherId": "morris-murye",
          "birthYear": "24:04:1949",
          "deathYear": "Alive"
        },
        {
          "id": "kwaje-rebecca",
          "name": "Kwaje Rebecca",
          "info": "Kwaje is the legitimate one and only wife of Azaria Wolyan, the mother Lodu Simya, Lupai Lawrence, Adede Rebecca, Wani Azaria and Poni Grace.",
          "fatherId": null,
          "birthYear": "01:05:1950",
          "deathYear": "Active"
        },
        {
          "id": "chaplain-soso-tongidyang",
          "name": "Chaplain Soso (Tongidyang)",
          "info": "Chaplain Soso, also called Tongidyang, was a child of Morris Murye and Rebecca Kiden. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1951",
          "deathYear": "Alive"
        },
        {
          "id": "modong-soso",
          "name": "Modong Na Soso",
          "info": "Modong Na Soso is the one and only wife of Chaplain Soso Tongidyang, the mother of Adede Asanti, Kojo Soso, Poni Soso, Wani Soso, Peace Soso and Joshua Soso.",
          "fatherId":null,
          "birthYear": "01:01:1985",
          "deathYear": "Active"
        },
        {
          "id": "simon-wolyan",
          "name": "Simon Wolyan",
          "info": "Simon Wolyan was a child of Morris Murye and Rebecca Kiden. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:06:1954",
          "deathYear": "01:06:2016"
        },
        {
          "id": "cecelia-yine",
          "name": "Cecelia Yine",
          "info": "Cecelia Yine was a child of Morris Murye and Rebecca Kiden. She married Gale from a Kakwa tribe and bore him Abe Emmanuel, Diko Jacob, kiden Elizabeth, Tabu Gloria, Amalia Stella and Poni Phionah.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1956",
          "deathYear": "Alive"
        },
        {
          "id": "joseph-loguli",
          "name": "Joseph Loguli",
          "info": "Joseph Loguli was a child of Morris Murye and Rebecca Kiden. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1959",
          "deathYear": "Alive"
        },
        {
          "id": "rejoice-poni",
          "name": "Rejoice Poni",
          "info": "Rejoice Poni was a child of Morris Murye and Rebecca Kiden. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1962",
          "deathYear": "Alive"
        },
        {
          "id": "julius-bongo",
          "name": "Julius Bongo",
          "info": "Julius Bongo was a child of Morris Murye and Rebecca Kiden. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1966",
          "deathYear": "Active"
        },
        {
          "id": "rejoice-jaguru",
          "name": "Rejoice Jaguru",
          "info": "Rejoice Jaguru is the first wife of Julius Bongo and mother to Annet Adede, Late Pamela Poni, Emmanuel Wani, Evaline Juru, Late Gladis Yangi and Kiden Patience.",
          "fatherId": null,
          "birthYear": "01:01:1975",
          "deathYear": "Active"
        },
        {
          "id": "juan-julius",
          "name": "Juan Na Bongo",
          "info": "Juan is the second wife of Julius Bongo. The mother of Kenyi Godwill, Lupai Surprise, Wani Bongo, Poni Julius and Adede Bongo.",
          "fatherId": null,
          "birthYear": "01:01:1980",
          "deathYear": "Alive and Healthy"
        },
        {
          "id": "isso-rebecca",
          "name": "Isso (Na Rebecca Kiden)",
          "info": "Isso Na Rebecca was a child of Morris Murye and Rebecca Kiden but died a baby. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1967",
          "deathYear": "Alive"
        },
        {
          "id": "losuba-oliver",
          "name": "Oliver Losuba (Gwolo)",
          "info": "Oliver Losuba, also called Gwolo, was a child of Morris Murye and Rebecca Kiden. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:02:1972",
          "deathYear": "unknown"
        },
        {
          "id": "muja-cecelia",
          "name": "Muja Cecelia",
          "info": "Muja Cecelia is the first wife of Losuba Oliver. She married Losuba Oliver in 1992. She is the proud mother of Poni Esther, The twin (Fraser Loku and Kenyi Losuba), Lupai Sete, Thomas Mogga, Evaline Poni, Stella Adede, and Harriet Kajogo.",
          "fatherId": "simisona-mogga-loyangi",
          "birthYear": "1973:01:01",
          "deathYear": "Active and living"
        },
        {
          "id": "esther-woro",
          "name": "Esther Woro",
          "info": "Esther Woro is the second wife of Losuba Oliver. She married Losuba Oliver in the year 2002. She is the mother of Moju Losuba, Kiden Robina, Desstiny Jijo, Rose Adede, and Keji Scovia.",
          "fatherId": "yowani-tongun",
          "birthYear": "12:12:1973",
          "deathYear": "Active and living"
        },
        {
          "id": "simisona-mogga-loyangi",
          "name": "Simisona Mogga Loyangi",
          "info": "Simisona Mogga Loyangi is the father of Muja Cecelia. He belongs to the Wandi Mangole clan and is from Gaderu Boma. He is the grandfather of the children born to Losuba Oliver through his second marriage.",
          "fatherId": null,
          "birthYear": "Unknown",
          "deathYear": "Unknown"
        },
        {
          "id": "yowani-tongun",
          "name": "Yowani Tongun",
          "info": "Yowani Tongun is the father of Esther Woro. He belongs to the elder generation of the lineage connected to Losuba Oliver through his first marriage.",
          "fatherId": null,
          "birthYear": "Unknown",
          "deathYear": "Unknown"
        },
        {
          "id": "jesilen-juan",
          "name": "Jesilen Juan",
          "info": "Jesilen Juan wife of Simsona Mogga, the mother of Muja Cecelia. She belongs to the Worongo clan and is from Liwolo Payam.",
          "deathYear": "Unknown"
        },
        {
          "id": "taibe-jijo",
          "name": "Taibe Jijo",
          "info": "Taibe Jijo is the mother of Esther Woro, the second wife of Losuba Oliver. She belongs to the Wanya clan from Gaderu.",
          "fatherId": null,
          "birthYear": "Unknown",
          "deathYear": "Unknown"
        },
        {
          "id": "gale-cecelia",
          "name": "Gale",
          "info": "Gale is the legitimate husband of Cecelia Yine and he fathered Abe Emmanuel, Diko Jacob, kiden Elizabeth, Tabu Gloria, Amalia Stella and Poni Phionah.",
          "fatherId": "gale-cecelia",
          "birthYear": "unknown",
          "deathYear": "Alive"
        },
        {
          "id": "nora-balai",
          "name": "Nora 'Balai",
          "info": "Nora 'Balai was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1946",
          "deathYear": "Deceased"
        },
        {
          "id": "helda-suku",
          "name": "Helda Suku",
          "info": "Helda Suku was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1948",
          "deathYear": "Alive"
        },
        {
          "id": "rasulia-modong",
          "name": "Rasulia Modong",
          "info": "Rasulia Modong was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "07:07:1950",
          "deathYear": "Alive"
        },
        {
          "id": "wanijo",
          "name": "Wanijo",
          "info": "Wanijo was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1952",
          "deathYear": "Deceased"
        },
        {
          "id": "lucia-yanya",
          "name": "Lucia Yanya",
          "info": "Lucia Yanya was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1955",
          "deathYear": "Alive"
        },
        {
          "id": "isso-gire",
          "name": "Isso Gire",
          "info": "Isso, also called Gire, was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1957",
          "deathYear": "Alive"
        },
        {
          "id": "mama-of-christina",
          "name": "Kulid Mama (of Christina)",
          "info": "Kulid was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1960",
          "deathYear": "Alive"
        },
        {
          "id": "margret-yine",
          "name": "Margret Yine",
          "info": "Margret Yine was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1963",
          "deathYear": "Alive"
        },
        {
          "id": "muggo-of-christina",
          "name": "Muggo (of Christina)",
          "info": "Muggo was a child of Morris Murye and Christina 'Diko. No further details.",
          "fatherId": "morris-murye",
          "birthYear": "01:01:1965",
          "deathYear": "Alive"
        },
        {
          "id": "bismarck-bungit",
          "name": "Bismarck Bungit",
          "info": "Bismarck Bungit was the son of Priscilla Baye. Father unknown. No further details.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "unknown"
        }
      ]
    },
    {
      "title": "7th Known Generation",
      "people": [
        {
          "id": "juan-edina",
          "name": "Juan Edina",
          "info": "Juan Edina is the first born daughter of Azaria Wolyan and Rebecca Kweja. She was married to Kenyi Evance from the clan of Moje na Kolondobong in Lori, Nyepo. She gave birth to Kiden Glory, Reja Christine, Murye Emmanuel, Evaline Jogo, Samson Bulli and lastly Poni Beatrice",
          "fatherId": "azaria-wolyan",
          "birthYear": "12:08:1973",
          "deathYear": "She's alive today."
        },
        {
          "id": "simaya-lo'du",
          "name": "Lo'du Simaya",
          "info": "Simaya is the second and first born male child of Azaria Wolyan and Rebecca Kwaje. He fathered Kiden Pamela, Gonya Annet, Lodu Simaya, Murye Joel, Jogo Hellen, Poni Simaya and Kojo Simaya from first wife Modong Rejoice, and Munduwa Simaya, 'Diko Beatrice,Pitia Simaya and Kiden Simaya from second wife Suzan Kiko.",
          "fatherId": "azaria-wolyan",
          "birthYear": "01:07:1975",
          "deathYear": "Alive today"
        },
        {
          "id": "lupai-lawrence",
          "name": "Lupai Lawrence",
          "info": "Lawrence is the son of Azaria Wolyan and Kwaje. He fathered Kenyi Charles, Murye Emmanuel, Unknown baby girl, Kiden Sarah, Jale David, Bulli Isaac and Losu Joshua from his legitimate wife Jane Kaku",
          "fatherId": "azaria-wolyan",
          "birthYear": "11:12:1978",
          "deathYear": "Alive"
        },
        {
          "id": "suku-azaria",
          "name": "Suku Na Azaria",
          "info": "Suku was a daughter of Azaria and Kweja. She died at a younger age",
          "fatherId": "azaria-wolyan",
          "birthYear": "11:12:1980",
          "deathYear": "Deceased"
        },
        {
          "id": "adede-nancy",
          "name": "Adede Nancy",
          "info": "Nancy is a daughter of Azaria and Kwaje. She is married to Boyo Moses Maku from the clan of Romogi and produced Kiden Beatrice, Desire Kiden, Jogo Mercy, Murye Savior and Justo Igga",
          "fatherId": "azaria-wolyan",
          "birthYear": "16:09:1983",
          "deathYear": "Active"
        },
            {
          "id": "wani-bennard",
          "name": "Wani Bennard",
          "info": "Bennard is the son of Azaria and Kwaje. He fathered Nelson Bulli from his wife Robina Apayi, and he had Kiden Samirah, Murye Bennard, Milla Bennard and Bulli Bennard from Stella Atimaku",
          "fatherId": "azaria-wolyan",
          "birthYear": "16:07:1986",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "lomudu-felex",
          "name": "Lomudu Felex",
          "info": "Felex was the seventh and last child of Azaria and Kwaje. He unfortunately died at an earlier age",
          "fatherId": "azaria-wolyan",
          "birthYear": "01:01:1988",
          "deathYear": "01:04:1989"
        },
        {
          "id": "abe-emmanuel",
          "name": "Abe Emmanuel",
          "info": "Abe is the first born son of Cecelia Yine and Gale.",
          "fatherId": "gale-cecelia",
          "birthYear": "20:12:1982",
          "deathYear": "Alive"
        },
        {
          "id": "diko-jacob",
          "name": "Diko Jacob",
          "info": "Jacob is the son of Cecelia Yine and Gale.",
          "fatherId": "gale-cecelia",
          "birthYear": "unknown",
          "deathYear": "Alive"
        },
        {
          "id": "kiden-elizabeth",
          "name": "Kiden Elizabeth",
          "info": "Kiden Elizabeth also known as Betty is the daughter of Cecelia Yine and Gale.",
          "fatherId": "gale-cecelia",
          "birthYear": "unknown",
          "deathYear": "Alive"
        },
        {
          "id": "tabu-gloria",
          "name": "Tabu Gloria",
          "info": "Gloria is a daughter of Cecelia Yine and Gale.",
          "fatherId": "gale-cecelia",
          "birthYear": "unknown",
          "deathYear": "Alive"
        },
        {
          "id": "grace-akulya",
          "name": "Grace Akulya",
          "info": "Akulya is the daughter of Cecelia Yine and Gale.",
          "fatherId": "gale-cecelia",
          "birthYear": "unknown",
          "deathYear": "Alive"
        },
        {
          "id": "amalia-stella",
          "name": "Amalia Stella",
          "info": "Stella is the second last born daughter of Cecelia Yine and Gale.",
          "fatherId": "gale-cecelia",
          "birthYear": "unknown",
          "deathYear": "Alive"
        },
        {
          "id": "poni-phionah",
          "name": "Poni Phionah",
          "info": "Phionah is the youngest daughter of Cecelia Yine and Gale.",
          "fatherId": "gale-cecelia",
          "birthYear": "unknown",
          "deathYear": "Alive"
        },
        {
          "id": "adede-annet",
          "name": "Adede Annet",
          "info": "Annet is the first born child of Bongo Julius and Rejoice Jaguru. She is married to Dilla Theophilus and they have two children together, Jason Sakor Dilla and Peggy Kongo Dilla. Annet also has a son named Moses Pitia, fathered by Jacob Kamilo.",
          "fatherId": "julius-bongo",
          "birthYear": "01:07:1994",
          "deathYear": "Alive and Healthy"
        },
        {
          "id": "poni-pamela",
          "name": "Poni Pamela",
          "info": "Pamela was the second born daughter of Bongo Julius and Rejoice Jaguru. ",
          "fatherId": "julius-bongo",
          "birthYear": "01:01:1997",
          "deathYear": "01:01:2000"
        },
        {
          "id": "emmanuel-wani",
          "name": "Emmanuel Wani",
          "info": "Emmanuel Wani, commonly known as Tella, is the third born and the only son of Bongo Julius and Rejoice Jaguru.",
          "fatherId": "julius-bongo",
          "birthYear": "09:09:1999",
          "deathYear": "Alive and Healthy"
        },
        {
          "id": "evaline-juru",
          "name": "Evaline Juru",
          "info": "Juru is the fourth born daughter of Bongo Julius and Rejoice Jaguru. Named by her mother after her grandmother Juru 'Nyola.",
          "fatherId": "julius-bongo",
          "birthYear": "14:07:2002",
          "deathYear": "Very Healthy"
        },
        {
          "id": "gladis-yangi",
          "name": "Gladis Yangi",
          "info": "Gladis was the fifth born daughter of Bongo Julius and Rejoice Jaguru. She unfortunately passed away at a very young age due to illness in Waliji refugee settlement.",
          "fatherId": "julius-bongo",
          "birthYear": "03:05:2004",
          "deathYear": "14:08:2005"
        },
        {
          "id": "kiden-patience",
          "name": "Kiden Patience",
          "info": "Patience is the sixth and last born daughter of Bongo Julius and Rejoice Jaguru. She was born in Mundari Civil Hospital",
          "fatherId": "julius-bongo",
          "birthYear": "25:02:2008",
          "deathYear": "Alive and Healthy"
        },
        {
          "id": "Kenyi-godwill",
          "name": "Kenyi Godwill",
          "info": "Kenyi is the first born son of Bongo Julius and Juan Julius.",
          "fatherId": "julius-bongo",
          "birthYear": "01:01:1999",
          "deathYear": "Alive and Healthy"
        },
        {
          "id": "lupai-surprise",
          "name": "Lupai Surprise",
          "info": "Surprise is the second born daughter of Bongo Julius and Juan Julius.",
          "fatherId": "julius-bongo",
          "birthYear": "01:01:2001",
          "deathYear": "Alive and Healthy"
        },
        {
          "id": "wani-bongo",
          "name": "Wani Bongo",
          "info": "Wani Bongo is the third born son of Bongo Julius and Juan Julius.",
          "fatherId": "julius-bongo",
          "birthYear": "01:10:2003",
          "deathYear": "Very Healthy"
        },
        {
          "id": "poni-bongo",
          "name": "Poni Na Bongo",
          "info": "Poni is the fourth born daughter of Bongo Julius and Juan Julius.",
          "fatherId": "julius-bongo",
          "birthYear": "01:10:2006",
          "deathYear": "Very Healthy"
        },
        {
          "id": "adede-bongo",
          "name": "Adede Na Bongo",
          "info": "Adede Na Bongo is the fifth and last born daughter of Bongo Julius and Juan Julius.",
          "fatherId": "julius-bongo",
          "birthYear": "01:10:2007",
          "deathYear": "Very Healthy"
        },
        {
          "id": "adede-na-simon",
          "name": "Adede Recheal",
          "info": "Adede Recheal was the daughter of Simon Wolyan(Kagiri) and his unkwnown wife especially to the Author.",
          "fatherId": "simon-wolyan",
          "birthYear": "unknown",
          "deathYear": "29:10:2025"
        },
        {
          "id": "adede-loguli-j",
          "name": "Adede Na Joseph",
          "info": "Adede Na Joseph is the first born daughter of Joseph Loguli and his unkwnown wife especially to the Author.",
          "fatherId": "joseph-loguli",
          "birthYear": "unknown",
          "deathYear": "Very Healthy"
        },
        {
          "id": "lupai-loguli-j",
          "name": "Lupai Lo Joseph",
          "info": "Lupai Lo Joseph is the son of Joseph Loguli and his unkwnown wife especially to the Author.",
          "fatherId": "joseph-loguli",
          "birthYear": "unknown",
          "deathYear": "Very Healthy"
        },
        {
          "id": "poni-esther",
          "name": "Poni Esther",
          "info": "Poni Esther is the first born daughter of Losuba Oliver and Muja Cecelia. She is the mother of Joshua Murye.",
          "fatherId": "losuba-oliver",
          "birthYear": "1995:02:01",
          "deathYear": "Active"
        },
        {
          "id": "fraser-loku",
          "name": "Fraser Loku",
          "info": "Fraser Loku is a twin son of Losuba Oliver and Muja Cecelia.. He died at a younger age.",
          "fatherId": "losuba-oliver",
          "birthYear": "1997:01:01",
          "deathYear": "Deceased"
        },
        {
          "id": "kenyi-losuba",
          "name": "Kenyi Losuba",
          "info": "Kenyi Losuba is a twin son of Losuba Oliver and Muja Cecelia. He died at a younger age.",
          "fatherId": "losuba-oliver",
          "birthYear": "1997:01:01",
          "deathYear": "Deceased"
        },
        {
          "id": "lupai-sete",
          "name": "Lupai Sete",
          "info": "Lupai Sete is a child of Losuba Oliver and Muja Cecelia. He died at younger age.",
          "fatherId": "losuba-oliver",
          "birthYear": "1999:01:01",
          "deathYear": "Active"
        },
        {
          "id": "thomas-mogga",
          "name": "Thomas Mogga",
          "info": "Thomas Mogga is a son of Losuba Oliver and Muja Cecelia.",
          "fatherId": "losuba-oliver",
          "birthYear": "2002:10:06",
          "deathYear": "Active"
        },
        {
          "id": "evaline-poni",
          "name": "Evaline Poni",
          "info": "Evaline Poni is a daughter of Losuba Oliver and Muja Cecelia.",
          "fatherId": "losuba-oliver",
          "birthYear": "2004:08:27",
          "deathYear": "Active"
        },
        {
          "id": "stella-adede",
          "name": "Stella Adede",
          "info": "Stella Adede is a daughter of Losuba Oliver and Muja Cecelia.",
          "fatherId": "losuba-oliver",
          "birthYear": "2007:01:10",
          "deathYear": "Active"
        },
        {
          "id": "harriet-kajogo",
          "name": "Harriet Kajogo",
          "info": "Harriet Kajogo is the last born daughter of Losuba Oliver and Muja Cecelia.",
          "fatherId": "losuba-oliver",
          "birthYear": "2009:12:12",
          "deathYear": "Active"
        },
        {
          "id": "moju-losuba",
          "name": "Moju Losuba",
          "info": "Moju Losuba was the first born child of Losuba Oliver and Esther Woro. He passed away at a young age.",
          "fatherId": "losuba-oliver",
          "birthYear": "2003:01:01",
          "deathYear": "Deceased"
        },
        {
          "id": "kiden-robina",
          "name": "Kiden Robina",
          "info": "Kiden Robina is a daughter of Losuba Oliver and Esther Woro. She is the mother of Destiny Jijo.",
          "fatherId": "losuba-oliver",
          "birthYear": "2004:02:01",
          "deathYear": "Active"
        },
        {
          "id": "rose-adede",
          "name": "Rose Adede",
          "info": "Rose Adede is a daughter of Losuba Oliver and Esther Woro. She is the mother of Phiona Kiden.",
          "fatherId": "losuba-oliver",
          "birthYear": "2006:06:01",
          "deathYear": "Active"
        },
        {
          "id": "keji-scovia",
          "name": "Keji Scovia",
          "info": "Keji Scovia is the last born daughter of Losuba Oliver and Esther Woro.",
          "fatherId": "losuba-oliver",
          "birthYear": "2008:08:01",
          "deathYear": "Active"
        } 
      ]
    },
    {
      "title": "8th Known Generation",
      "people": [
        {
          "id": "kiden-gloria",
          "name": "Kiden Gloria",
          "info": "Gloria is the first child of Juan Edina and Kenyi Evance",
          "fatherId": "kenyi-evance",
          "birthYear": "01:01:2005",
          "deathYear": "Active"
        },
        {
          "id": "reja-christine",
          "name": "Reja Christine",
          "info": "Reja is the child of Juan Edina and Kenyi Evance",
          "fatherId": "kenyi-evance",
          "birthYear": "01:01:2007",
          "deathYear": "Active and growing"
        },
        {
          "id": "murye-emmanuel-edina",
          "name": "Murye Emmanuel Juan",
          "info": "Murye Na Edina is the third born child of Juan Edina and Kenyi Evance",
          "fatherId": "kenyi-evance",
          "birthYear": "01:01:2009",
          "deathYear": "Active and growing"
        },
        {
          "id": "evaline-jogo",
          "name": "Evaline Jogo",
          "info": "Evaline Jogo is a child of Juan Edina and Kenyi Evance",
          "fatherId": "kenyi-evance",
          "birthYear": "01:01:2011",
          "deathYear": "She's alive today."
        },
        {
          "id": "samson-bulli",
          "name": "Bulli Samson",
          "info": "Samson Bulli is a child of Juan Edina and Kenyi Evance",
          "fatherId": "kenyi-evance",
          "birthYear": "01:01:2014",
          "deathYear": "Active and growing"
        },
        {
          "id": "poni-beatrice",
          "name": "Poni Beatrice",
          "info": "Beatrice Poni is the 6th and last born child of Juan Edina and Kenyi Evance",
          "fatherId": "kenyi-evance",
          "birthYear": "01:01:2016",
          "deathYear": "Active and growing"
        },
        {
          "id": "kiden-pamela",
          "name": "Kiden Pamela",
          "info": "Kiden Pamela is the first born child of Simaya Lo'du and Modong Rejoice.",
          "fatherId": "simaya-lo'du",
          "birthYear": "01:01:2001",
          "deathYear": "Active and growing"
        },
        {
          "id": "annet-gonya",
          "name": "Gonya Annet",
          "info": "Gonya Annet is the second born child of Simaya Lo'du and Modong Rejoice.",
          "fatherId": "simaya-lo'du",
          "birthYear": "01:01:2003",
          "deathYear": "Active and growing"
        },
        {
          "id": "lodu-simaya-child",
          "name": "Lodu Simaya Lo'du",
          "info": "Lodu was the child of Simaya Lo'du and Modong Rejoice.",
          "fatherId": "simaya-lo'du",
          "birthYear": "09:06:2010",
          "deathYear": "Active and growing"
        },
        {
          "id": "murye-joel",
          "name": "Murye Joel",
          "info": "Murye Joel is the child of Simaya Lo'du and Modong Rejoice.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "jogo-hellen",
          "name": "Jogo Hellen",
          "info": "Jogo Hellen is the child of Simaya Lo'du and Modong Rejoice.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "poni-simaya",
          "name": "Poni Na Simaya",
          "info": "Poni Na Simaya is the child of Simaya Lo'du and Modong Rejoice.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "kojo-simaya",
          "name": "Kojo Na Simaya",
          "info": "Kojo Na Simaya is the child of Simaya Lo'du and Modong Rejoice.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "munduwa-simaya",
          "name": "Munduwa Na Simaya",
          "info": "Munduwa Simaya is the child of Simaya Lo'du and Suzan Kiko.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "diko-beatrice",
          "name": "Diko Beatrice",
          "info": "Diko Beatrice is the child of Simaya Lo'du and Suzan Kiko.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "pitia-simaya",
          "name": "Pitia Lo Simaya",
          "info": "Pitia Lo Simaya is the child of Simaya Lo'du and Suzan Kiko.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "kiden-simaya",
          "name": "Kiden Na Simaya",
          "info": "Kiden Na Simaya is the child of Simaya Lo'du and Suzan Kiko.",
          "fatherId": "simaya-lo'du",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "kenyi-charles",
          "name": "Kenyi Charles Lupai",
          "info": "Kenyi Charles is the first born child of Lupai Lawrence and Jane Kaku.",
          "fatherId": "lupai-lawrence",
          "birthYear": "09:06:2010",
          "deathYear": "Active and growing"
        },
        {
          "id": "murye-emmanuel-lupai",
          "name": "Murye Emmanuel Lupai",
          "info": "is the child of Lupai Lawrence and Jane Kaku.",
          "fatherId": "lupai-lawrence",
          "birthYear": "09:09:2012",
          "deathYear": "Active and growing"
        },
        {
          "id": "unknown-lawrence-l",
          "name": "Unknown child of Lawrence",
          "info": "The unknown baby girl child of Lupai Lawrence and Jane Kaku died near birth time but was named and the name is what the Author Tella couldn't find out.",
          "fatherId": "lupai-lawrence",
          "birthYear": "01:01:2014",
          "deathYear": "Deceased"
        },
        {
          "id": "kiden-sarah",
          "name": "Kiden Sarah Lupai",
          "info": "Kiden Sarah Lupai also known as Amama is the third and the first daughter of Lupai Lawrence and Jane Kaku.",
          "fatherId": "lupai-lawrence",
          "birthYear": "21:10:2015",
          "deathYear": "Active and growing"
        },
        {
          "id": "jale-david-lupai",
          "name": "Jale David Lupai",
          "info": "Jale David is the child of Lupai Lawrence and Jane Kaku.",
          "fatherId": "lupai-lawrence",
          "birthYear": "29:04:2018",
          "deathYear": "Active and growing"
        },
        {
          "id": "bulli-isaac-lupai",
          "name": "Bulli Isaac Lupai",
          "info": "Bulli Isaac is the child of Lupai Lawrence and Jane Kaku.",
          "fatherId": "lupai-lawrence",
          "birthYear": "16:12:2020",
          "deathYear": "Active and growing"
        },
        {
          "id": "losu-joshua-lupai",
          "name": "Losu Joshua Lupai",
          "info": "Losu Joshua is the child of Lupai Lawrence and Jane Kaku.",
          "fatherId": "lupai-lawrence",
          "birthYear": "09:06:2010",
          "deathYear": "Active and growing"
        },
        {
          "id": "kiden-beatrice",
          "name": "Kiden Beatrice",
          "info": "Kiden Beatrice is the first born child of Adede Nancy and Boyo Moses Makur.",
          "fatherId": "boyo-moses",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "desire-kiden",
          "name": "Desire Kiden(Na-wani)",
          "info": " is the child of Adede Nancy and Boyo Moses Makur.",
          "fatherId": "boyo-moses",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "jogo-mercy",
          "name": "Jogo Mercy Boyo",
          "info": "Jogo Mercy is the third born child of Adede Nancy and Boyo Moses Makur.",
          "fatherId": "boyo-moses",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "murye-savior",
          "name": "Murye Savior",
          "info": "Murye Savior is the child of Adede Nancy and Boyo Moses Makur.",
          "fatherId": "boyo-moses",
          "birthYear": "17:02:2017",
          "deathYear": "Active and growing"
        },
        {
          "id": "justo-igga",
          "name": "Justo Igga",
          "info": "Justo Igga is the last born child of Adede Nancy and Boyo Moses Makur.",
          "fatherId": "boyo-moses",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "bulli-nelson",
          "name": "Bulli Nelson",
          "info": "Bulli Nelson is the first born child of Wani Bennard and Robina Apayi.",
          "fatherId": "wani-bennard",
          "birthYear": "01:01:2013",
          "deathYear": "Active and growing"
        },
        {
          "id": "kiden-samirah",
          "name": "Kiden Samirah",
          "info": "Kiden Samirah is the child of Wani Bennard and the first born child of his second wife Stella Atimaku.",
          "fatherId": "wani-bennard",
          "birthYear": "01:01:2014",
          "deathYear": "Active and growing"
        },
        {
          "id": "murye-bennard",
          "name": "Murye Bennard",
          "info": "Murye Bennard is the child of Wani Bennard and Stella Atimaku.",
          "fatherId": "wani-bennard",
          "birthYear": "01:01:2016",
          "deathYear": "01:01:2018"
        },
        {
          "id": "milla-bennard",
          "name": "Milla Bennard",
          "info": "Milla Bennard is the child of Wani Bennard and Stella Atimaku.",
          "fatherId": "wani-bennard",
          "birthYear": "unknown",
          "deathYear": "Active and growing"
        },
        {
          "id": "bulli-bennard-atimaku",
          "name": "Bulli Bennard Atimaku",
          "info": "Bulli Bennard Atimaku is the child of Wani Bennard and Stella Atimaku.",
          "fatherId": "wani-bennard",
          "birthYear": "01:01:2014",
          "deathYear": "Active and growing"
        },
        {
          "id": "moses-pitia",
          "name": "Moses Pitia",
          "info": "Moses Pitia is the first born son of Adede Annet, Fathered by Jacob Kamilo.",
          "fatherId": null,
          "birthYear": "27:02:2015",
          "deathYear": "Very Healthy"
        },
        {
          "id": "jason-sakor-dilla",
          "name": "Jason Sakor Dilla",
          "info": "Jason is the second born son of Adede Annet, Fathered by Dilla Theophilus.",
          "fatherId": "dilla-theophilus",
          "birthYear": "23:03:2023",
          "deathYear": "Active and growing"
        },
        {
          "id": "konga-peggy-dilla",
          "name": "Konga Peggy Dilla",
          "info": "Konga Peggy Dilla is the third and first born daughter of Adede Annet, Fathered by Dilla Theophilus.",
          "fatherId": "dilla-theophilus",
          "birthYear": "23:07:2025",
          "deathYear": "Growing Toddler"
        },
        {
          "id": "phiona-kiden",
          "name": "Phiona Kiden",
          "info": "Phiona Kiden is the daughter of Rose Adede.",
          "fatherId": "unknown",
          "birthYear": "2021:08:25",
          "deathYear": "Active and growing"
        },
        {
          "id": "joshua-murye",
          "name": "Joshua Murye",
          "info": "Joshua Murye is the son of Poni Esther and fathered by Mercy.",
          "fatherId": "unknown",
          "birthYear": "2021:01:01",
          "deathYear": "Active and growing"
        },
        {
          "id": "destiny-jijo",
          "name": "Destiny Jijo",
          "info": "Destiny Jijo is the daughter of Kiden Robina. She was born on 15 April 2022",
          "fatherId": "unknown",
          "birthYear": "2022:04:15",
          "deathYear": "Active and growing"
        }
      ]
    },
    {
      "title": "In-laws of the 7th Generation",
      "people": [
        {
          "id": "kenyi-evance",
          "name": "Kenyi Evance",
          "info": "Evance is the husband of Juan Edina and father to Kiden Gloria, Reja Christine, Murye Emmanuel lo Juan, Evaline Jogo, Bulli Samson and Poni Beatrice. He is hails from the clan of Moje na kolondobong from Lori",
          "fatherId": null,
          "birthYear": "01:01:1968",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "modong-rejoice",
          "name": "Modong Rejoice Simaya",
          "info": "Modong Rejoice is the first wife of Lo'du Simaya Azaria and the mother of Kiden Pamela, Annet Gonya, Lodu Lo Lo'du Simaya, Murye Joel, Jogo Hellen, Poni Simaya and lastly Kojo Simaya. She hails from the clan of Korsak palekerot from Kansuk.",
          "fatherId": null,
          "birthYear": "01:01:1983",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "suzan-kiko",
          "name": "Suzan kiko",
          "info": "Suzan Kiko is the second wife of Lo'du Simaya Azaria and the mother of Munduwa Simaya, 'Diko Beatrice, Pitia Simaya and lastly Kiden Simaya. She was the daughter of Yoasa Leju from the Pojulu tribe",
          "fatherId": null,
          "birthYear": "01:01:1983",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "jane-kaku",
          "name": "Jane Kaku Lupai",
          "info": "Kaku is the legitimate wife of Lupai Lawrence Azaria and the mother of Kenyi Charles, Emmanuel Murye Lupai, Unknown child of Lupai, Kiden Sarah, Jale David, Bulli Isaac and Losu Joshua. She was the daughter of Daniel Bedeng Benzamin Kenyi the former paramount chief of Nyepo payam who hailed from the clan of Porodong from Lori and his wife Mary Woro Jale from the clan of Korsak palekerot from Lori.",
          "fatherId": null,
          "birthYear": "01:01:1986",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "boyo-moses",
          "name": "Boyo Moses Maku",
          "info": "Boyo Moses is the legitimate husband of Adede Nancy Azaria and the father of Kiden(Na Wani) Beatrice, Desire Kiden(Na Woja), Jogo Mercy, Murye Savior and lastly Justo Igga. He was the son of Maku Yonah of Romogi clan at Kerwa in Liwolo.His mother is Antelia Juan Igga.",
          "fatherId": null,
          "birthYear": "01:01:1986",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "robina-apayi",
          "name": "Robina Apayi",
          "info": "Robina Apayi was the first wife of Wani Bennard and bored Bulli Nelson before they had a divorce. She hails from the wo'gat clan. no more information",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "stella-atimaku",
          "name": "Stella Atimaku",
          "info": "Stella Atimaku is the current wife of Wani Bennard and the mother of Kiden Samirah, Murye Bennard, Milla Bennard and Bulli Bennard.",
          "fatherId": null,
          "birthYear": "unknown",
          "deathYear": "Active and Healthy"
        },
        {
          "id": "dilla-theophilus",
          "name": "Dilla Theophilus",
          "info": "Dilla Theophilus is the husband of Adede Annet and father to Jason Sakor Dilla and Peggy Kongo Dilla.",
          "fatherId": null,
          "birthYear": "01:01:1990",
          "deathYear": "Active and Healthy"
        }
      ]
    }
  ]
}
